import pandas as pd
import torch


class preprocessor():
    def __init__(self, dataset_file_path):
        feats1 = ['급여-2', '급여-1', '신용-2', '신용-1', '체크-2', '체크-1', '수신-2', '수신-1', '현금-2', '현금-1']
        feats2 = ['전문직여부', '세분화고수신고객여부', '세분화고소득고객여부', '실적기준고객우대구분코드', 
                    '방카슈랑스보유좌수', '수익증권좌수', '신탁좌수', 
                    '연간상품가입건수', '전월대출월평균잔액', '급여이체여부', '자동이체거래건수', '수신좌수']
        df = pd.read_parquet(dataset_file_path)
        df['급여-2']=(df['삼개월급여이체실적금액']-df['전월급여이체실적금액']-df['급여이체실적금액'])
        df['급여-1']=df['전월급여이체실적금액']
        df['신용-2']=(df['삼개월신용카드사용금액']-df['전월신용카드사용금액']-df['신용카드사용금액'])
        df['신용-1']=df['전월신용카드사용금액']
        df['체크-2']=(df['삼개월체크카드금액']-df['전월체크카드금액']-df['체크카드거래금액'])
        df['체크-1']=df['전월체크카드금액']
        df['수신-2']=(df['삼개월수신평균잔액']*3-df['전월수신평균잔액']-df['수신잔액'])
        df['수신-1']=df['전월수신평균잔액']
        df['현금-2']=(df['삼개월현금서비스금액']-df['전월현금서비스금액']-df['현금서비스이용금액'])
        df['현금-1']=df['전월현금서비스금액']
        self.data = df